MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FX512VMD15/mcu.h
#define DMAMUX0_CHCFG3                (*((volatile uint32_t *)0x40021000))      // Channel Configuration register
#define DMAMUX0_CHCFG2                (*((volatile uint32_t *)0x40021001))      // Channel Configuration register
#define DMAMUX0_CHCFG1                (*((volatile uint32_t *)0x40021002))      // Channel Configuration register
#define DMAMUX0_CHCFG0                (*((volatile uint32_t *)0x40021003))      // Channel Configuration register
#define DMAMUX0_CHCFG7                (*((volatile uint32_t *)0x40021004))      // Channel Configuration register
#define DMAMUX0_CHCFG6                (*((volatile uint32_t *)0x40021005))      // Channel Configuration register
#define DMAMUX0_CHCFG5                (*((volatile uint32_t *)0x40021006))      // Channel Configuration register
#define DMAMUX0_CHCFG4                (*((volatile uint32_t *)0x40021007))      // Channel Configuration register
#define DMAMUX0_CHCFG11               (*((volatile uint32_t *)0x40021008))      // Channel Configuration register
#define DMAMUX0_CHCFG10               (*((volatile uint32_t *)0x40021009))      // Channel Configuration register
#define DMAMUX0_CHCFG9                (*((volatile uint32_t *)0x4002100A))      // Channel Configuration register
#define DMAMUX0_CHCFG8                (*((volatile uint32_t *)0x4002100B))      // Channel Configuration register
#define DMAMUX0_CHCFG15               (*((volatile uint32_t *)0x4002100C))      // Channel Configuration register
#define DMAMUX0_CHCFG14               (*((volatile uint32_t *)0x4002100D))      // Channel Configuration register
#define DMAMUX0_CHCFG13               (*((volatile uint32_t *)0x4002100E))      // Channel Configuration register
#define DMAMUX0_CHCFG12               (*((volatile uint32_t *)0x4002100F))      // Channel Configuration register
#define DMAMUX1_CHCFG3                (*((volatile uint32_t *)0x40022000))      // Channel Configuration register
#define DMAMUX1_CHCFG2                (*((volatile uint32_t *)0x40022001))      // Channel Configuration register
#define DMAMUX1_CHCFG1                (*((volatile uint32_t *)0x40022002))      // Channel Configuration register
#define DMAMUX1_CHCFG0                (*((volatile uint32_t *)0x40022003))      // Channel Configuration register
#define DMAMUX1_CHCFG7                (*((volatile uint32_t *)0x40022004))      // Channel Configuration register
#define DMAMUX1_CHCFG6                (*((volatile uint32_t *)0x40022005))      // Channel Configuration register
#define DMAMUX1_CHCFG5                (*((volatile uint32_t *)0x40022006))      // Channel Configuration register
#define DMAMUX1_CHCFG4                (*((volatile uint32_t *)0x40022007))      // Channel Configuration register
#define DMAMUX1_CHCFG11               (*((volatile uint32_t *)0x40022008))      // Channel Configuration register
#define DMAMUX1_CHCFG10               (*((volatile uint32_t *)0x40022009))      // Channel Configuration register
#define DMAMUX1_CHCFG9                (*((volatile uint32_t *)0x4002200A))      // Channel Configuration register
#define DMAMUX1_CHCFG8                (*((volatile uint32_t *)0x4002200B))      // Channel Configuration register
#define DMAMUX1_CHCFG15               (*((volatile uint32_t *)0x4002200C))      // Channel Configuration register
#define DMAMUX1_CHCFG14               (*((volatile uint32_t *)0x4002200D))      // Channel Configuration register
#define DMAMUX1_CHCFG13               (*((volatile uint32_t *)0x4002200E))      // Channel Configuration register
#define DMAMUX1_CHCFG12               (*((volatile uint32_t *)0x4002200F))      // Channel Configuration register


//*****************************************************************************
//
// Enhanced Direct Memory Access (eDMA) registers
//
//*****************************************************************************

#define DMA_CR                        (*((volatile uint32_t *)0x40008000))      // Control Register (DMA_CR)
#define DMA_ES                        (*((volatile uint32_t *)0x40008004))      // Error Status Register (DMA_ES)
#define DMA_ERQ                       (*((volatile uint32_t *)0x4000800C))      // Enable Request Register (DMA_ERQ)
#define DMA_EEI                       (*((volatile uint32_t *)0x40008014))      // Enable Error Interrupt Register (DMA_EEI)
#define DMA_CEEI                      (*((volatile uint32_t *)0x40008018))      // Clear Enable Error Interrupt Register (DMA_CEEI)
#define DMA_SEEI                      (*((volatile uint32_t *)0x40008019))      // Set Enable Error Interrupt Register (DMA_SEEI)
#define DMA_CERQ                      (*((volatile uint32_t *)0x4000801A))      // Clear Enable Request Register (DMA_CERQ)
#define DMA_SERQ                      (*((volatile uint32_t *)0x4000801B))      // Set Enable Request Register (DMA_SERQ)
#define DMA_CDNE                      (*((volatile uint32_t *)0x4000801C))      // Clear DONE Status Bit Register (DMA_CDNE)
#define DMA_SSRT                      (*((volatile uint32_t *)0x4000801D))      // Set START Bit Register (DMA_SSRT)
#define DMA_CERR                      (*((volatile uint32_t *)0x4000801E))      // Clear Error Register (DMA_CERR)
#define DMA_CINT                      (*((volatile uint32_t *)0x4000801F))      // Clear Interrupt Request Register (DMA_CINT)
#define DMA_INT                       (*((volatile uint32_t *)0x40008024))      // Interrupt Request Register (DMA_INT)
#define DMA_ERR                       (*((volatile uint32_t *)0x4000802C))      // Error Register (DMA_ERR)
#define DMA_HRS                       (*((volatile uint32_t *)0x40008034))      // Hardware Request Status Register (DMA_HRS)
#define DMA_EARS                      (*((volatile uint32_t *)0x40008044))      // Enable Asynchronous Request in Stop Register (DMA_EARS)
#define DMA_DCHPRI3                   (*((volatile uint32_t *)0x40008100))      // Channel n Priority Register (DMA_DCHPRI3)
#define DMA_DCHPRI2                   (*((volatile uint32_t *)0x40008101))      // Channel n Priority Register (DMA_DCHPRI2)
#define DMA_DCHPRI1                   (*((volatile uint32_t *)0x40008102))      // Channel n Priority Register (DMA_DCHPRI1)


//*****************************************************************************
//
// External Watchdog Monitor (EWM) registers
//
//*****************************************************************************

