MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FX512VMD15/mcu.h
#define tag[19:6]                     0x1FFF80000      // 14-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW1Sn register.
//
//*****************************************************************************

#define tag[19:6]                     0x1FFF80000      // 14-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW2Sn register.
//
//*****************************************************************************

#define tag[19:6]                     0x1FFF80000      // 14-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW3Sn register.
//
//*****************************************************************************

#define tag[19:6]                     0x1FFF80000      // 14-bit tag for cache entry
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnMU register.
//
//*****************************************************************************

#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnMU register.
//
//*****************************************************************************

#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnMU register.
//
//*****************************************************************************

#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnMU register.
//
//*****************************************************************************

