MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FX512VMD15/mcu.h
#define COUNT                         0x7FFF8000      // Number of receive packets with less than 64 bytes and bad CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_JAB register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets greater than MAX_FL and bad CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P64 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 64-byte receive packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P65TO127 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 65- to 127-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P128TO255 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 128- to 255-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P256TO511 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 256- to 511-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P512TO1023 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 512- to 1023-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P1024TO2047 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of 1024- to 2047-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_P_GTE2048 register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of greater-than-2048-byte recieve packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_OCTETS register.
//
//*****************************************************************************

#define COUNT                         0x7FFFFFFF80000000      // Number of receive octets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_DROP register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Frame count


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_FRAME_OK register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames received OK


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_CRC register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames received with CRC error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_ALIGN register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames received with alignment error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_MACERR register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Receive FIFO overflow count


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_FDXFC register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of flow-control pause frames received


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_R_OCTETS_OK register.
//
//*****************************************************************************

#define COUNT                         0x7FFFFFFF80000000      // Number of octets for frames received without error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATCR register.
//
//*****************************************************************************

#define SLAVE                         0x00002000      // Enable Timer Slave Mode
#define CAPTURE                       0x00000800      // Capture Timer Value
#define RESTART                       0x00000200      // Reset Timer
#define PINPER                        0x00000080      // Enables event signal output assertion on period event
#define PEREN                         0x00000020      // Enable Periodical Event
#define OFFRST                        0x00000008      // Reset Timer On Offset Event
#define OFFEN                         0x00000004      // Enable One-Shot Offset Event
#define EN                            0x00000001      // Enable Timer


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATVR register.
//
//*****************************************************************************

#define ATIME                         0x7FFFFFFF80000000      // A write sets the timer


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATOFF register.
//
//*****************************************************************************

#define OFFSET                        0x7FFFFFFF80000000      // Offset value for one-shot event generation


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATPER register.
//
//*****************************************************************************

#define PERIOD                        0x7FFFFFFF80000000      // Value for generating periodic events


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATCOR register.
//
//*****************************************************************************

#define COR                           0x1FFFFFFFC0000000      // Correction Counter Wrap-Around Value
#define Reserved                      0xFFFF80000000      // This read-only field is reserved and always has the value 0.
#define INC_CORR                      0x001FC000      // Correction Increment Value
#define Reserved                      0x00000080      // This read-only field is reserved and always has the value 0.
#define COR                           0x00001FC0      // Correction Counter Wrap-Around Value


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATINC register.
//
//*****************************************************************************

#define INC_CORR                      0x001FC000      // Correction Increment Value
#define INC                           0x00001FC0      // Clock Period Of The Timestamping Clock (ts_clk) In Nanoseconds
#define Reserved                      0xFFFF80000000      // This read-only field is reserved and always has the value 0.
#define Reserved                      0x00000080      // This read-only field is reserved and always has the value 0.


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_ATSTMP register.
//
//*****************************************************************************

